module.exports = {
  /************************************************************************************************************
   *  코드에프 게정 정보
   ************************************************************************************************************/

  /**	OAUTH 서버 도메인	*/
  OAUTH_DOMAIN: "https://oauth.codef.io",

  /**	OAUTH 엑세스 토큰 발급 URL PATH	*/
  GET_TOKEN: "/oauth/token",

  /**   토큰발급 재시도 3회  **/
  REPEAT_COUNT: 3,

  /**    정식 서버 도메인    */
  API_DOMAIN: "https://api.codef.io",

  /**	데모 서버 도메인	*/
  DEMO_DOMAIN: "https://development.codef.io",

  /**	샌드박스 서버 도메인	*/
  SANDBOX_DOMAIN: "https://sandbox.codef.io",
  SANDBOX_CLIENT_ID: "ef27cfaa-10c1-4470-adac-60ba476273f9",
  SANDBOX_CLIENT_SECRET: "83160c33-9045-4915-86d8-809473cdf5c3",

  /************************************************************************************************************
   *  코드에프 응답 코드
   *************************************************************************************************************/

  /** 응답부 수행 결과 키워드	*/
  RESULT: "result",

  /** 응답부 수행 결과 메시지 코드 키워드	*/
  CODE: "code",

  /** 응답부 수행 결과 메시지 키워드	*/
  MESSAGE: "message",

  /** 응답부 수행 결과 추가 메시지 키워드	*/
  EXTRA_MESSAGE: "extraMessage",

  /**	응답부 수행 결과 데이터 키워드	*/
  DATA: "data",

  /**	엑세스 토큰 거절 사유1	*/
  INVALID_TOKEN: "invalid_token",

  /**	엑세스 토큰 거절 사유2	*/
  ACCESS_DENIED: "access_denied",

  /************************************************************************************************************
   *     코드에프 서비스 타입(0:정식, 1:데모, 2:샌드박스)
   *************************************************************************************************************/

  SERVICE_TYPE_API: 0, // 정식
  SERVICE_TYPE_DEMO: 1, // 데모
  SERVICE_TYPE_SANDBOX: 2, // 샌드박스

  /************************************************************************************************************
   *  코드에프 상품 URL 정보
   *************************************************************************************************************/
  // /**	요청 상품 주소	*/
  // PRODUCT_URL: "",

  /**	커넥티드 아이디 목록 조회 URL	*/
  GET_CID_LIST: "/v1/account/connectedId-list",

  /**	계정 목록 조회 URL	*/
  GET_ACCOUNT_LIST: "/v1/account/list",

  /**	계정 등록 URL	*/
  CREATE_ACCOUNT: "/v1/account/create",

  /**	계정 추가 URL	*/
  ADD_ACCOUNT: "/v1/account/add",

  /**	계정 수정 URL	*/
  UPDATE_ACCOUNT: "/v1/account/update",

  /**	계정 삭제 URL	*/
  DELETE_ACCOUNT: "/v1/account/delete",
};
